<template>
    <div class="wrapper" >
        <navbar :title="title"  @goback="goback" ></navbar>
        <scroller>
            <div class="rulesBox ">
                <text class="rulesText">
            欢迎来到魔篇，魔篇旨在为用户提供一个友好的网络沟通交流环境，供大家进行讨论分享、结识伙伴以及提出生活建议。在魔篇参与交流活动的每一位用户都应该恪守网络道德，礼貌对待他人。如此魔篇的作用才能得到最大发挥，同时也可以让大家更好地进行交流。

            一、基本条款

               1. 在使用魔篇服务前，请认真阅读本守则。所有在魔篇进行一切操作的用户，均被视为已经阅读、理解并无限制且无条件地同意、遵守本守则的各项条款与条件。

               2. 用户应主动了解、遵守《互联网电子公告服务管理规定》及中华人民共和国其它各项有关法律法规，本守则将遵循中华人民共和国有关法律法规，守则未涉及的问题参见国家有关法律法规。当本守则与国家法律法规冲突时，以国家法律法规为准。

               3. 用户在魔篇发表的文章、主题、回复等一切言论仅代表作者本人的观点，不代表魔篇的观点，与魔篇的立场无关。用户须承担一切因其本人言论而直接或间接造成的民事或刑事法律责任。

               4. 对于用户发表的帖子内容，作者本人享有其帖子内容的相关版权。对于魔篇里的一切内容，包括（但不限于）用户的资料、主题、回复、附件，魔篇保留编辑、修改、删除、回收的权利。

               5. 魔篇在特殊或紧急情况下，保留在没有事先通知的情况下关闭魔篇的权力，由此造成的一切损失魔篇将不负任何责任。

               6. 对于用户哪些该做，哪些不该做，本守则仅列出了一些基本条款，并非没有遗漏，未必涵盖所有不当行为，因此魔篇管理团队保留在特定情况下，根据其完全的判断力，独立于本守则施行管理操作的权力。

               本守则有不足之处，将在日后不断完善，用户有义务及时确认最新版本的守则。若对本守则的更新持有疑问，可向魔篇管理团队了解情况或申请终止其魔篇用户服务。

            二、用户相关规章条款

               用户使用魔篇时，不得利用用户个人信息设置，发表以下内容：

               1.包含任何违反国家有关法律法规的内容。

               2.带有恶意的、不文明的、易产生歧义与误解的字词符号。

               3.使用高仿用户名、恶意模仿其他用户、组织或官方工作人员。

               4.直接或间接地宣传一切涉及广告、商业性质的对象。

               5. 含有性相关或强烈性暗示、影响用户体验（超长头像头衔）的内容。

            三、发帖相关规章条款

               1. 不得发表违规信息言论，包括（但不限于）政治、淫秽、色情、暴力、赌博、宗教、种族，一切言论必须遵循《互联网电子公告服务管理规定》及国家其它有关法律法规，包括地方性及临时性法规。

               2. 不得发表无意义的垃圾内容，包括（但不限于）恶意灌水刷帖、无意义一句话主题、脸滚键盘回复、重复连帖。同时用户不应对垃圾内容进行回复或附议。

               3. 不得发表涉及广告宣传、商业性质的内容，包括（但不限于）帐号买卖、服务器贩卖或宣传、求购信息等的内容。

               4.不得发表恶意形式的内容，包括（但不限于）涉及人身攻击、挑衅歧视、辱骂威胁、煽动诋毁、虚假造谣、消极否定的内容。

               5. 不得发表危害计算机安全的内容，包括（但不限于）含有病毒外挂、恶意代码、钓鱼木马、不明网站的文本、链接、程序。

               6. 不得发表违背知识产权保护的内容，包括（但不限于）涉及破解盗版、抄袭剽窃的下载、主题、回复、讨论、附议及鼓励。

               7. 不得公开发表涉及私下交友的内容，包括（但不限于）如“加我微信/QQxxxxxxx详聊”、“服务器群号xxxxxxx”等内容。

               不得在未经他人知情及允许的情况下发表他人的真实资料、照片与姓名等隐私信息，无论信息真实与否，无论出于任何目的。

            四、其它行为规范

               1. 友好礼貌尊重他人
               魔篇里的每位用户都应当得到相同的尊重。如果你对别人的观点持不同意见，我们鼓励你参与讨论，与作者辩论，但是请不要采取漫骂诋毁等形式进行人身攻击。尊重他人的同时也是在尊重你自己。

               2. 正确归类帖子主题
               为了方便用户更好地找到自己所需的内容，魔篇开启了帖子分类的功能。用户在发表主题时应正确归类帖子，根据主题的内容性质选择恰当的圈子，若实在不清楚确切的分类可选择与内容最为接近的分类，并在有必要的情况下联系魔篇管理团队做适当的迁移。

               3. 积极参与监督举报
               为了更好地维护魔篇，保持良性发展，魔篇施行全民监督举报政策。若发现他人违反论坛规章守则、发表不恰当内容之时，可向管理团队举报并说明情况。

            五、违规处罚策略

               为了提供给用户一个相对更加开放的魔篇，魔篇将尽力降低管理强度，但这并不代表用户可以随意发表言论。如果用户不遵守魔篇的相关规章守则，那么处罚与封禁将不可避免。魔篇对用户的处罚手段主要为“警告”与“封禁”两类。处罚的一般规则如下：

               1.若用户发表的内容违反了魔篇规章守则，酌情对内容进行屏蔽或删除，并处以该用户一次警告处罚。

               2.若用户多次违规收到多次警告，则处以该用户一次临时封禁处罚。

               3.若用户仍持续多次违规收到警告、封禁处罚，则处以该用户永久封禁处罚。

               注意，施行处罚之前，魔篇管理团队总会考虑用户的历史记录等信息，处罚高低的最终决定权在魔篇管理团队。管理团队可按其完全的判断力，根据实际情况独立于以上标准施行处罚。

            六、其它

               1. 本守则不是对某种语言限制，在魔篇发表的任何语言都适用于本守则，无论其用中文或其它任何语言表达。 其它地区的用户若自愿使用魔篇，将有责任确保其行为符合在所在地法律法规。

               2.对该守则魔篇保留包括最终解析权在内的一切权利。



                </text>
            </div>
        </scroller>
    </div>
</template>
<style>
    .rulesText{
        font-size: 26px;
    }
    .rulesBox{
        width:750px;
        padding-left:30px;
        padding-right:30px;
    }
</style>
<script>
    import {event} from '../../../weex.js'
    import navbar from '../../../include/navbar.vue';
    export default {
        data(){
            return{

            }
        },
        props: {
            title: { default: "用户使用协议" }
        },
        components: {
            navbar
        },
        methods:{
            goback: function (e) {
                event.closeURL();
            },
        }
    }
</script>